Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71J21B.PIC
      <edc:SFRDef edc:_addr="0x40038354" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA4USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038358" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="USBHS_DEVDMA4USBHS_DEVDMACONTROL" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:desc="Load Next Channel Transfer Descriptor Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:desc="End of Transfer Enable Control (OUT transfers only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:desc="End of Buffer Enable Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:desc="End of Transfer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:desc="End of Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:desc="Descriptor Loaded Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:desc="Burst Lock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:desc="Buffer Byte Length (Write-only)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003835C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_DEVDMA4USBHS_DEVDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038360" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA5USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038364" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA5USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038368" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="USBHS_DEVDMA5USBHS_DEVDMACONTROL" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:desc="Load Next Channel Transfer Descriptor Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:desc="End of Transfer Enable Control (OUT transfers only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:desc="End of Buffer Enable Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:desc="End of Transfer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:desc="End of Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:desc="Descriptor Loaded Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:desc="Burst Lock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:desc="Buffer Byte Length (Write-only)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003836C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_DEVDMA5USBHS_DEVDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038370" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA6USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038374" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA6USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
