Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71J21B.PIC
      <edc:DCRDef edc:_addr="0xC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD3" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_96" edc:desc="Lock Region 96" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_97" edc:desc="Lock Region 97" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_98" edc:desc="Lock Region 98" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_99" edc:desc="Lock Region 99" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_100" edc:desc="Lock Region 100" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_101" edc:desc="Lock Region 101" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_102" edc:desc="Lock Region 102" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_103" edc:desc="Lock Region 103" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_104" edc:desc="Lock Region 104" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_105" edc:desc="Lock Region 105" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_106" edc:desc="Lock Region 106" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_107" edc:desc="Lock Region 107" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_108" edc:desc="Lock Region 108" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_109" edc:desc="Lock Region 109" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_110" edc:desc="Lock Region 110" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_111" edc:desc="Lock Region 111" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_112" edc:desc="Lock Region 112" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_113" edc:desc="Lock Region 113" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_114" edc:desc="Lock Region 114" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_115" edc:desc="Lock Region 115" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_116" edc:desc="Lock Region 116" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_117" edc:desc="Lock Region 117" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_118" edc:desc="Lock Region 118" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_119" edc:desc="Lock Region 119" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_120" edc:desc="Lock Region 120" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_121" edc:desc="Lock Region 121" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_122" edc:desc="Lock Region 122" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_123" edc:desc="Lock Region 123" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_124" edc:desc="Lock Region 124" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_125" edc:desc="Lock Region 125" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_126" edc:desc="Lock Region 126" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_127" edc:desc="Lock Region 127" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TWD0" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS0"/>
      <edc:VirtualPin edc:name="LONCOL1" edc:ppsfunction="B" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PIODC0" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TWCK0" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS0"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C" ltx:memberofperipheral="UART1"/>
      <edc:VirtualPin edc:name="PIODC1" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP3" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="B" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="URXD1" edc:ppsfunction="C" ltx:memberofperipheral="UART1"/>
      <edc:VirtualPin edc:name="PIODC2" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP4" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="XIN32" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="B" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="XOUT32" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="URXD0" edc:ppsfunction="A" ltx:memberofperipheral="UART0"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="B" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PIODC3" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP6" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A" ltx:memberofperipheral="UART0"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="PIODC4" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC5" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP7" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC6" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC7" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODCEN1" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP8" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RXD1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="PIODCEN2" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RK" edc:ppsfunction="A" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PIODCCLK" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="CANTX0" edc:ppsfunction="A" ltx:memberofperipheral="MCAN0"/>
      <edc:VirtualPin edc:name="CTS0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="CANRX0" edc:ppsfunction="A" ltx:memberofperipheral="MCAN0"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="RTS0" edc:ppsfunction="C" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS1"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MLBCLK" edc:ppsfunction="C" ltx:memberofperipheral="MLB"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS1"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MLBDAT" edc:ppsfunction="C" ltx:memberofperipheral="MLB"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="TRACESWO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDIO" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDCLK" edc:ppsfunction="X1" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PIOB"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="ERASE" edc:ppsfunction="X1" ltx:memberofperipheral="EFC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default" ltx:memberofperipheral="PIOD"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="A" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1" ltx:memberofperipheral="DACC"/>
    </edc:Pin>
